#### Handling Missing Data

In [1]:
import numpy as np
import pandas as pd

In [4]:
string_data = pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])

In [5]:
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [7]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [8]:
string_data[0] = None
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

In [9]:
from numpy import nan as NA

data = pd.Series([1, NA, 3.5, NA, 7])
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [15]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [16]:
data = pd.DataFrame([[1, 6.5, 3], [1, NA, NA],
                    [NA, NA, NA], [NA, 6.5, 3]])

In [17]:
cleaned = data.dropna()

In [18]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [19]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [20]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [22]:
data[4] = NA

In [23]:
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [24]:
data.dropna(axis=1, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [25]:
df = pd.DataFrame(np.random.randn(7, 3))
df.iloc[:4, 1] = NA
df.iloc[:2, 2] = NA
df

          0         1         2
0 -0.858684       NaN       NaN
1 -0.854066       NaN       NaN
2 -0.569122       NaN  0.140153
3 -0.814000       NaN -0.380603
4  1.554303  1.131705 -1.142841
5  2.015661  0.276674 -1.332055
6 -0.232359 -0.217255 -1.507893

In [26]:
df.dropna()

          0         1         2
4  1.554303  1.131705 -1.142841
5  2.015661  0.276674 -1.332055
6 -0.232359 -0.217255 -1.507893

In [35]:
df.dropna(thresh=3)

          0         1         2
4  1.554303  1.131705 -1.142841
5  2.015661  0.276674 -1.332055
6 -0.232359 -0.217255 -1.507893

In [36]:
df.fillna(0)

          0         1         2
0 -0.858684  0.000000  0.000000
1 -0.854066  0.000000  0.000000
2 -0.569122  0.000000  0.140153
3 -0.814000  0.000000 -0.380603
4  1.554303  1.131705 -1.142841
5  2.015661  0.276674 -1.332055
6 -0.232359 -0.217255 -1.507893

In [37]:
df.fillna({1: 0.5, 2: 0})

          0         1         2
0 -0.858684  0.500000  0.000000
1 -0.854066  0.500000  0.000000
2 -0.569122  0.500000  0.140153
3 -0.814000  0.500000 -0.380603
4  1.554303  1.131705 -1.142841
5  2.015661  0.276674 -1.332055
6 -0.232359 -0.217255 -1.507893

In [38]:
_ = df.fillna(0, inplace=True)

In [39]:
df

          0         1         2
0 -0.858684  0.000000  0.000000
1 -0.854066  0.000000  0.000000
2 -0.569122  0.000000  0.140153
3 -0.814000  0.000000 -0.380603
4  1.554303  1.131705 -1.142841
5  2.015661  0.276674 -1.332055
6 -0.232359 -0.217255 -1.507893

In [40]:
df = pd.DataFrame(np.random.randn(6, 3))

df.iloc[2:, 1] = NA
df.iloc[4:, 2] = NA
df

          0         1         2
0 -0.577904 -1.551457 -1.313937
1 -2.646764 -1.098716 -2.468072
2 -0.469943       NaN -0.159996
3 -0.860531       NaN -0.435763
4  0.110997       NaN       NaN
5 -0.679673       NaN       NaN

In [42]:
df.fillna(method='ffill')

          0         1         2
0 -0.577904 -1.551457 -1.313937
1 -2.646764 -1.098716 -2.468072
2 -0.469943 -1.098716 -0.159996
3 -0.860531 -1.098716 -0.435763
4  0.110997 -1.098716 -0.435763
5 -0.679673 -1.098716 -0.435763

In [43]:
df.fillna(method='ffill', limit=2)

          0         1         2
0 -0.577904 -1.551457 -1.313937
1 -2.646764 -1.098716 -2.468072
2 -0.469943 -1.098716 -0.159996
3 -0.860531 -1.098716 -0.435763
4  0.110997       NaN -0.435763
5 -0.679673       NaN -0.435763

In [44]:
data = pd.Series([1, NA, 3.5, NA, 7])

In [45]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64